{
  "skills": [
    "TypeScript",
    "Tailwind",
    "Next.js",
    "React",
    "React Native",
    "Node",
    "GraphQL",
    "Firebase"
  ],
  "jobs": [
    {
      "title": "Senior Engineer",
      "company": {
        "name": "1v1Me",
        "website": "https://1v1me.com"
      },
      "start": "June 2022",
      "end": "Present",
      "achievements": [
        "Accelerated 0-1 product development for a user-facing web application using Next.js, TypeScript, and Tailwind, successfully scaling to over 20,000 new users per month.",
        "Engineered innovative features enabling users to compete in various video games for monetary rewards.",
        "Crafted functionalities allowing users to stake on the outcomes of professional esports matches, adding an exciting dimension to the user experience.",
        "Developed an engaging bracketed tournament feature, fostering a competitive environment for users.",
        "Implemented seamless CI/CD for web app rollouts utilizing GitHub Actions and Vercel, ensuring efficient and consistent updates.",
        "Constructed a versatile internal tools application using React and TypeScript, streamlining internal processes and workflows.",
        "Employed Electron to develop Windows and Mac desktop applications, complete with a custom auto-updating system for optimal user experiences.",
        "Managed end-to-end deployments and software upgrades for desktop applications, maintaining consistent performance and reliability.",
        "Actively participated in feature planning and project scoping discussions, contributing valuable insights and expertise.",
        "Seamlessly integrated with popular sports and competitive games, including Call of Duty, Apex Legends, and Fortnite, broadening the platform's appeal to a diverse range of gaming enthusiasts.",
        "Skillfully integrated with third-party payment processors, ensuring secure and efficient transactions for users across the platform.",
        "Implemented an immersive live match viewing experience, complete with the ability to switch between user perspectives and engage in real-time chat with fellow spectators, fostering a dynamic and interactive community atmosphere."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": {
        "name": "P00LS",
        "website": "https://launchpad.p00ls.io"
      },
      "start": "December 2021",
      "end": "June 2022",
      "achievements": [
        "Spearheaded the selection and interview process for top-tier development talent, ensuring a robust pipeline of skilled professionals.",
        "Designed and engineered a bespoke CMS using Next.js, TypeScript, and Firebase, streamlining content management and increasing productivity.",
        "Crafted an engaging, consumer-facing application featuring a gamified ERC20 token earning system, utilizing React, Next.js, TypeScript, and Firebase.",
        "Pioneered the development of an innovative token claiming system, leveraging Next.js and TypeScript to enable seamless interaction with the Ethereum blockchain.",
        "Implemented a versatile localization and accessibility framework, enhancing user experience and inclusivity across all applications.",
        "Employed Tailwind CSS to establish a consistent and visually appealing UX throughout all product offerings.",
        "Orchestrated seamless deployments to both development and production environments on Google Cloud, ensuring optimal performance and reliability."
      ]
    },
    {
      "title": "Lead Engineer",
      "company": {
        "name": "Movement Mortgage",
        "website": "https://movement.com"
      },
      "start": "April 2021",
      "end": "December 2021",
      "achievements": [
        "Directed the screening and interview process for development hires, fostering a talented and well-rounded team.",
        "Devised a comprehensive in-house SDLC process, optimizing software development and ensuring timely project completion.",
        "Conducted thorough code reviews and championed adherence to development best practices, maintaining high-quality code standards.",
        "Conceived and engineered a custom CRM solution, employing React, Redux, and Redux Saga to enhance internal workflow efficiency.",
        "Spearheaded the successful migration of applications from JavaScript to TypeScript, improving code maintainability and scalability.",
        "Crafted REST-based microservices in Node.js, expertly deploying them to Azure for streamlined application integration and robust performance."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": {
        "name": "Diligent",
        "website": "https://diligent.com"
      },
      "start": "December 2019",
      "end": "March 2021",
      "achievements": [
        "Championed the creation of micro-frontend integrations across diverse products, leveraging the power of React.js and Angular for seamless user experiences.",
        "Engineered expansive React applications with TypeScript, expertly scaling to accommodate over 200,000 satisfied customers.",
        "Contributed to the development of various microservices, utilizing cutting-edge tools such as Go/Golang and Node.js for optimal performance.",
        "Aided in the construction of a cohesive, company-wide UI component library, streamlining design and enhancing consistency.",
        "Established a robust and scalable Next.js and TypeScript architecture, laying the foundation for successful greenfield product development.",
        "Actively participated in code reviews, upholding development best practices and maintaining high-quality standards.",
        "Collaborated with Operations and Product teams, ensuring timely product delivery and outstanding customer satisfaction."
      ]
    },
    {
      "title": "AVP; Software Engineer",
      "company": {
        "name": "Bank of America",
        "website": "https://bankofamerica.com/"
      },
      "start": "January 2018",
      "end": "November 2019",
      "achievements": [
        "Earned prestigious Gold and Bronze accolades for exceptional performance and dedication.",
        "Spearheaded the development of scalable Next.js and GraphQL-based UIs, enhancing user experiences and application efficiency.",
        "Designed front-end application scaffolding, pipelines, and UI component libraries using React and TypeScript, optimizing project workflows.",
        "Engineered workflow automation web applications and analytical dashboards for internal Information Security teams, streamlining processes.",
        "Crafted insightful analytics dashboards, providing valuable data-driven insights.",
        "Collaborated closely with customers to gather requirements and guarantee timely product delivery, ensuring satisfaction.",
        "Pioneered the development of Mattermost and Jira integrations across multiple applications and processes, boosting productivity.",
        "Conceived and developed client-side applications using Next.js, React, Redux, Redux Saga, and CSS-in-JS libraries, for a seamless user experience.",
        "Created server-side APIs using Express/Koa and MongoDB/MySQL, enhancing application functionality and performance.",
        "Thrived in an agile environment, skillfully utilizing sprints and Gitflow to drive project success.",
        "Conducted meticulous code reviews and enforced development best practices, maintaining high-quality standards.",
        "Presented captivating product demonstrations to customers and stakeholders, showcasing application features and benefits.",
        "Mentored junior and mid-level developers on emerging technologies, fostering a culture of continuous learning and growth."
      ]
    },
    {
      "title": "Software Engineer",
      "company": {
        "name": "Bank of America",
        "website": "https://bankofamerica.com/"
      },
      "start": "July 2017",
      "end": "January 2018",
      "achievements": []
    },
    {
      "title": "Web Developer",
      "company": {
        "name": "Burke",
        "website": "https://weareburke.com/"
      },
      "start": "February 2017",
      "end": "July 2017",
      "achievements": []
    },
    {
      "title": "Freelance Developer",
      "company": {
        "name": "antfreda.com",
        "website": "https://antfreda.com/"
      },
      "start": "July 2015",
      "end": "July 2017",
      "achievements": []
    }
  ],
  "links": [
    {
      "href": "mailto:anthonyfreda323@gmail.com",
      "label": "anthonyfreda323@gmail.com"
    },
    {
      "href": "https://github.com/Afreda323",
      "label": "github.com/Afreda323"
    },
    {
      "href": "https://linkedin.com/in/antfreda323",
      "label": "linkedin.com/in/antfreda323"
    }
  ]
}
